package Ramen;

import java.util.HashMap;
import java.util.Map;
import java.util.Set;

public class Lesson10 {
    public static void main(String[] args) {
        String info = "java is cool and java is fast";
        Map<String,Integer> map = new HashMap<>();
        Set<String> keys = map.keySet();
        for(String key : keys){
            Integer value = map.get(key);
            map.put(key,value+1);
        }
        System.out.println(map.size());


    }
// “Статистика слов”
//    Написать программу, которая:
//    Получает на вход строку текста (например: "java is cool and java is fast").
//    Разбивает текст на слова.
//    Используя коллекции Map и Set, делает следующее:
//            🔹 Требования:
//    Подсчитать, сколько раз каждое слово встречается. (использовать Map<String, Integer>)
//    Создать Set уникальных слов.
//    Вывести:
//    Все слова и их количество в формате:
//    java -> 2
//    is -> 2
//    cool -> 1
//    Количество уникальных слов.
//    Отсортировать слова по алфавиту и вывести в отсортированном виде.


}
