package Ramen;

import java.util.Scanner;

public class Lesson1 {
    public static void main(String[] args) {
//
//
//         которая проверяет, положительное число, отрицательное или нол
////ь.
//        Чуть сложнее:
//        Вводится число. Если оно чётное — вывести "чётное", иначе — "нечётное".
//
//                Среднее:
//        Пользователь вводит возраст. Если меньше 18 — вывести "несовершеннолетний", если от 18 до 60 — "взрослый", если больше 60 — "пенсионер".
//
//                Сложнее:
//        Пользователь вводит три числа. Найди и выведи самое большое из них.
//
//                Продвинутое:
//        Пользователь вводит год. Определи, является ли он високосным (делится на 4, но не на 100, или делится на 400).


//        int num1 = -10;
//        if (num1 > 0){
//            System.out.println(num1 +" положительно число");
//        } else if (num1 == 0) {
//            System.out.println(num1 +" ноль");
//        }else {
//            System.out.println(num1 +" отрицальное число");
//        }


//        Scanner sc = new Scanner(System.in);
//        System.out.println("введите число чтоб узнать  что за число");
//        int num = sc.nextInt();
//        if (num % 2 == 0){
//            System.out.println( num+" четное");
//        }if (num % 2 == 1){
//            System.out.println(num + " не четное");
//        }else {
//            System.out.println("Аяна");
//        }

    }
}
