package _10_Loops.Practca;

import java.util.Scanner;

public class Lesson1 {
    public static void main(String[] args) {

//        Scanner input = new Scanner(System.in);
//        System.out.println("введите число");
//        int number = input.nextInt();
//        for (int i = 1; i < 100; i++) {
//            number = i;
//            if (number % 2 == 0){
//                System.out.println("четное"+ i);
//            }else if (number != 2 || number % 3 == 0){
//                System.out.println("не четное:"+number );
//            }}
//        Scanner input = new Scanner(System.in);
//        System.out.println("введите число");
//        int number = input.nextInt();
//
//        for (int i = 1; i <= number; i++) {
//            if (i % 2 == 0) {
//                System.out.println("четное: " + i);
//            } else {
//                System.out.println("нечетное: " + i);
//            }
//        }

//
//        Scanner input = new Scanner(System.in);
//        System.out.print("Введите цифру из таблицы умножение до 10!");
//        int number = input.nextInt();
//        for (int i = 1; i <= 10; i++) {
//            System.out.println(number + "*" + i + "= " + number * i);
//
//        }

//        🧩 Задание:
//        Пользователь вводит число n.
//        Нужно вывести все числа от n до 1 в обратном порядке.
//📘 Пример (если n = 5):
//        5
//        4
//        3
//        2
//        1
        Scanner input2 = new Scanner(System.in);
        System.out.println("введите число");
        int number2 = input2.nextInt();
        for (int i = number2; i >= 1; i--) {

            System.out.println(i);


        }


/*
        Посчитать сумму чисел от 1 до 100.
        Вывести таблицу умножения числа 5.
        Вывести все числа от 10 до 1 в обратном порядке.
        Пользователь вводит число — вывести все числа от 1 до этого числа.
        Пользователь вводит число — посчитать сумму всех чисел от 1 до этого числа.
        Найти факториал числа (например, 5! = 1×2×3×4×5).
        Вывести квадраты чисел от 1 до 10.
        Найти количество цифр в введённом числе.*/
//        displayNumbers();
//        displayNumbers2();

    }
//
//    public static void displayNumbers() {
//        // Вывести числа от 1 до 10.
//        for (int i = 1; i <= 10; i++) {
//            System.out.println(i);
//        }
//    }

//    public static void displayNumbers2() {
//    int i = 1;
//        // Вывести только чётные числа от 1 до 20.

    /// /        for (int i = 1; i <= 100; i ++) {
    /// /            System.out.println(i % 2 == 0);


    //   }
    // }


    }

